<?php
    $citiesArray = [
        "Ленинградская область:" => [
            "Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"
        ],
        "Московская область:" => [
            "Москва", "Зеленоград", "Клин"
        ],
        "Рязанская область" => [
            "Новомичуринск", "Рязань", "Спасск-Рязанский"
        ],
        "Тверская область:" => [
            "Вышний волочек", "Торжок", "Тверь"
        ]
    ];
    
    foreach($citiesArray as $my_key => $my_value) {
        echo "<h3>$my_key</h3>";
        foreach($my_value as $city) {
            if (mb_substr($city, 0, 1) ===  "К") {
                echo "<p style=\"margin-left: 10px;\">$city</p>";
            }
        }
    }