<?php
    function translit($data) {
        $alphabet = [
            "а" => "a",     "б" => "b",     "в" => "v",
            "г" => "g",     "д" => "d",     "е" => "e",
            "ё" => "e",     "ж" => "zh",    "з" => "z",
            "и" => "i",     "к" => "k",     "л" => "l",
            "м" => "m",     "н" => "n",     "о" => "o",
            "п" => "p",     "р" => "r",     "с" => "c",
            "т" => "t",     "у" => "u",     "ф" => "f",
            "х" => "kh",    "ц" => "ts",    "ч" => "ch",
            "ш" => "sh",    "щ" => "shch",  "Ъ" => "",
            "Ы" => "y",     "Ь" => "",      "э" => "e",
            "Ю" => "yu",    "Я" => "ya"
        ];
        
        return strtr(str_ireplace(" ", "_", $data), $alphabet);
    }
    $string = "ехал грека через реку";
                       
    echo translit($string);