<?php
    $citiesArray = [
        "Ленинградская область:" => [
            "Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"
        ],
        "Московская область:" => [
            "Москва", "Зеленоград", "Клин"
        ],
        "Рязанская область" => [
            "Новомичуринск", "Рязань", "Спасск-Рязанский"
        ],
        "Тверская область:" => [
            "Вышний волочек", "Торжок", "Тверь"
        ]
    ];
    
    foreach($citiesArray as $my_key => $my_value) {
        echo "<h3>$my_key</h3>";
        for ($index = 0; $index < count($my_value); $index++) {
            echo "<p style=\"margin-left: 10px;\">$my_value[$index] </p>";
        }
    }